_posts/2013-03-01-Finding-equilibrium-composition-by-direct-minimization-of-Gibbs-free-energy-on-mole-numbers.html
---
title: Finding equilibrium composition by direct minimization of Gibbs free energy on mole numbers
date: 2013/03/01 12:27:48
updated: 2013/03/03 12:22:30
categories: 
tags: 
---


<p>
<a href="http://matlab.cheme.cmu.edu/2011/12/25/finding-equilibrium-composition-by-direct-minimization-of-gibbs-free-energy-on-mole-numbers/" >Matlab post</a>
Adapted from problem 4.5 in Cutlip and Shacham
Ethane and steam are fed to a steam cracker at a total pressure of 1 atm and at 1000K at a ratio of 4 mol H2O to 1 mol ethane. Estimate the equilibrium distribution of products (CH4, C2H4, C2H2, CO2, CO, O2, H2, H2O, and C2H6).
</p>

<p>
Solution method: We will construct a Gibbs energy function for the mixture, and obtain the equilibrium composition by minimization of the function subject to elemental mass balance constraints.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> numpy <span style="color: #8b0000;">as</span> np

R = 0.00198588 <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">kcal/mol/K</span>
T = 1000 <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">K</span>

species = [<span style="color: #228b22;">'CH4'</span>, <span style="color: #228b22;">'C2H4'</span>, <span style="color: #228b22;">'C2H2'</span>, <span style="color: #228b22;">'CO2'</span>, <span style="color: #228b22;">'CO'</span>, <span style="color: #228b22;">'O2'</span>, <span style="color: #228b22;">'H2'</span>, <span style="color: #228b22;">'H2O'</span>, <span style="color: #228b22;">'C2H6'</span>]

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">$G_^\circ for each species. These are the heats of formation for each</span>
<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">species.</span>
Gjo = np.array([4.61, 28.249, 40.604, -94.61, -47.942, 0, 0, -46.03, 26.13]) <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">kcal/mol</span>
</pre>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> The Gibbs energy of a mixture</h2>
<div class="outline-text-2" id="text-1">
<p>
We start with \(G=\sum\limits_j n_j \mu_j\). Recalling that we define \(\mu_j = G_j^\circ + RT \ln a_j\), and in the ideal gas limit, \(a_j = y_j P/P^\circ\), and that \(y_j = \frac{n_j}{\sum n_j}\). Since in this problem, P = 1 atm, this leads to the function \(\frac{G}{RT} = \sum\limits_{j=1}^n n_j\left(\frac{G_j^\circ}{RT} + \ln \frac{n_j}{\sum n_j}\right)\).
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> numpy <span style="color: #8b0000;">as</span> np

<span style="color: #8b0000;">def</span> <span style="color: #8b2323;">func</span>(nj):
    nj = np.array(nj)
    Enj = np.sum(nj);
    G = np.sum(nj * (Gjo / R / T + np.log(nj / Enj)))
    <span style="color: #8b0000;">return</span> G
</pre>
</div>
</div>
</div>
<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Linear equality constraints for atomic mass conservation</h2>
<div class="outline-text-2" id="text-2">
<p>
The total number of each type of atom must be the same as what entered the reactor. These form equality constraints on the equilibrium composition. We express these constraints as: \(A_{eq} n = b\) where \(n\) is a vector of the moles of each species present in the mixture. CH4 C2H4 C2H2 CO2 CO O2 H2 H2O C2H6
</p>

<div class="org-src-container">

<pre class="src src-python">Aeq = np.array([[0,   0,    0,   2,   1,  2,  0,  1,   0],      <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">oxygen balance</span>
                [4,   4,    2,   0,   0,  0,  2,  2,   6],      <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">hydrogen balance</span>
                [1,   2,    2,   1,   1,  0,  0,  0,   2]])     <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">carbon balance</span>

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">the incoming feed was 4 mol H2O and 1 mol ethane</span>
beq = np.array([4,  <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">moles of oxygen atoms coming in</span>
                14, <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">moles of hydrogen atoms coming in</span>
                2]) <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">moles of carbon atoms coming in</span>

<span style="color: #8b0000;">def</span> <span style="color: #8b2323;">ec1</span>(n):
    <span style="color: #228b22;">'equality constraint'</span>
    <span style="color: #8b0000;">return</span> np.dot(Aeq, n) - beq
</pre>
</div>

<p>
Now we solve the problem.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">initial guess suggested in the example</span>
n0 = [1e-3, 1e-3, 1e-3, 0.993, 1.0, 1e-4, 5.992, 1.0, 1e-3] 

<span style="color: #8b0000;">from</span> scipy.optimize <span style="color: #8b0000;">import</span> fmin_slsqp

X = fmin_slsqp(func, n0, f_eqcons=ec1, iter=300, acc=1e-12)

<span style="color: #8b0000;">for</span> s,x <span style="color: #8b0000;">in</span> <span style="color: #8b0000;">zip</span>(species, X):
    <span style="color: #8b0000;">print</span> <span style="color: #228b22;">'{0:10s} {1:1.4g}'</span>.format(s, x)

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">check that constraints were met</span>
<span style="color: #8b0000;">print</span> np.dot(Aeq, X) - beq
<span style="color: #8b0000;">print</span> np.all( np.abs( np.dot(Aeq, X) - beq) &lt; 1e-12)
</pre>
</div>

<pre class="example">
&gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; Optimization terminated successfully.    (Exit mode 0)
            Current function value: -104.403947663
            Iterations: 217
            Function evaluations: 2937
            Gradient evaluations: 217
&gt;&gt;&gt; ... ... CH4        0.06694
C2H4       8.108e-08
C2H2       5.174e-08
CO2        0.5441
CO         1.389
O2         1.222e-14
H2         5.343
H2O        1.523
C2H6       8.44e-08
... [ -1.66977543e-13   1.77635684e-15   4.44089210e-16]
True
</pre>

<p>
I found it necessary to tighten the accuracy parameter to get pretty good matches to the solutions found in Matlab. It was also necessary to increase the number of iterations. Even still, not all of the numbers match well, especially the very small numbers. You can, however, see that the constraints were satisfied pretty well.
</p>


<p>
Interestingly there is a distribution of products! That is interesting because only steam and ethane enter the reactor, but a small fraction of methane is formed! The main product is hydrogen. The stoichiometry of steam reforming is ideally \(C_2H_6 + 4H_2O \rightarrow 2CO_2 + 7 H2\). Even though nearly all the ethane is consumed, we do not get the full yield of hydrogen. It appears that another equilibrium, one between CO, CO2, H2O and H2, may be limiting that, since the rest of the hydrogen is largely in the water. It is also of great importance that we have not said anything about reactions, i.e. how these products were formed. 
</p>

<p>
The water gas shift reaction is: \(CO + H_2O \rightleftharpoons CO_2 + H_2\). We can compute the Gibbs free energy of the reaction from the heats of formation of each species. Assuming these are the formation energies at 1000K, this is the reaction free energy at 1000K.
</p>

<div class="org-src-container">

<pre class="src src-python">G_wgs = Gjo[3] + Gjo[6] - Gjo[4] - Gjo[7]
<span style="color: #8b0000;">print</span> G_wgs

K = np.exp(-G_wgs / (R*T))
<span style="color: #8b0000;">print</span> K
</pre>
</div>

<pre class="example">
-0.638
&gt;&gt;&gt; &gt;&gt;&gt; 1.37887528109
</pre>
</div>
</div>
<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Equilibrium constant based on mole numbers</h2>
<div class="outline-text-2" id="text-3">
<p>
One normally uses activities to define the equilibrium constant. Since there are the same number of moles on each side of the reaction all factors that convert mole numbers to activity, concentration or pressure cancel, so we simply consider the ratio of mole numbers here.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">print</span> (X[3] * X[6]) / (X[4] * X[7])
</pre>
</div>

<pre class="example">
1.37450039394
</pre>

<p>
This is close, but not exactly the same as the equilibrium constant computed above. I think they should be exactly the same, and the difference is due to convergence errors in the solution to the problem.
</p>

<p>
Clearly, there is an equilibrium between these species that prevents the complete reaction of steam reforming.
</p>
</div>
</div>
<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Summary</h2>
<div class="outline-text-2" id="text-4">
<p>
This is an appealing way to minimize the Gibbs energy of a mixture. No assumptions about reactions are necessary, and the constraints are easy to identify. The Gibbs energy function is especially easy to code.
</p>
</div>
</div>
<p>Copyright (C) 2013 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2013/03/01/Finding-equilibrium-composition-by-direct-minimization-of-Gibbs-free-energy-on-mole-numbers.org">org-mode source</a><p>